# https://github.com/Homebrew/homebrew-bundle

# specify a directory to install
cask_args appdir: '/Applications'

# Install packages
tap 'caskroom/homebrew-cask' || true
tap 'caskroom/versions' || true

# Essentials
brew 'neovim'
brew 'tmux'
brew 'git'
brew 'node'
brew 'lazygit'
brew 'gh'
brew 'ripgrep'
brew 'fzf'
brew 'btop'
brew 'yazi'
brew 'npm'
brew 'tree-sitter'  # Needed for nvim-treesitter
brew 'fd'           # Need this for Snacks explorer
brew 'ffmpeg'       # Needed for youtube-downloader
brew 'stow'         # GNU Stow for managing symlinks

# casks
cask 'spotify'
cask 'ghostty'

# python
brew 'python'
brew 'uv'           # Dependency manager
brew 'isort'        # Sort Python imports automatically
brew 'black'        # Python code formatter

# zsh
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'zsh-completions'
